# ResultsVisibleInView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialFieldManager..::..ResultsVisibleInView Property
SpatialFieldManager Class See Also
---
Enables analysis results visibility in the view.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool ResultsVisibleInView { get; set; }
```

Visual Basic
---
```text
Public Property ResultsVisibleInView As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ResultsVisibleInView {
	bool get ();
	void set (bool value);
}
```

# See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace